Revit 2027 API
Family.IsOwnerFamily Property
 True if the family is the owner family for its own editable document, false otherwise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsOwnerFamily { get; }
Public ReadOnly Property IsOwnerFamily As Boolean
	Get
public:
property bool IsOwnerFamily {
	bool get ();
}
member IsOwnerFamily : bool with get
Property Value
Boolean
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace